<script setup>
import {getTaskList, removeTaskList} from "@/api/project/task.js";
import {ref} from "vue";
import {listProjectAll} from "@/api/project/project.js";
import {list as getUserList} from '@/api/project/user.js'
import {ElNotification} from "element-plus";
import {formatDateToEnglish, getDateDiff, parseTime} from "@/utils/ruoyi.js";

const {proxy} = getCurrentInstance()
const queryParams = ref({
  start: 1,
  end: 10,
  name: '',
  pjProjectId: null,
  projectUserId: null,
  status: null,
  urgency: null
})
const projectOptions = ref([])
const userOptions = ref([])

function userSelectChange(val) {
  if (val) {
    if (queryParams.value.pjProjectId === null) {
      ElNotification({
        title: 'Tip',
        type: 'warning',
        message: '请先选择项目',
        duration: 2000,
      })
    } else {
      getUserList({projectId: queryParams.value.pjProjectId}).then(res => {
        userOptions.value = res.data
      })
    }
  }
}

function projectSelectChange(val) {
  if (val) {
    queryParams.value.projectUserId = null
    userOptions.value = []
  }
}

function handleProjectOptions() {
  listProjectAll().then(res => {
    projectOptions.value = res.data
  })
}

const tableData = ref([])
const total = ref(0)

function handleQuery() {
  getTaskList(queryParams.value).then(res => {
    tableData.value = res.data.rows
    total.value = res.data.total
  })
}

function resetQuery() {
  queryParams.value = {
    start: 1,
    end: 10,
    name: '',
    pjProjectId: '',
    projectUserId: null,
    status: null,
    urgency: null
  }
  handleQuery()
}

const ids = ref([]);
const single = ref(true);
const multiple = ref(true);

function handleSelectionChange(selection) {
  ids.value = selection.map(item => item.id);
  single.value = selection.length != 1;
  multiple.value = !selection.length;
}

function handleDelete(row) {
  const _id = row.id || ids.value
  proxy.$confirm('确定删除选中的任务么？该任务下关联的文件等都将会被删除', '提示', {
    confirmButtonText: '确定',
    cancelButtonText: '取消',
    type: 'warning'
  }).then(() => {
    removeTaskList(_id).then(res => {
      if (res.code === 200) {
        proxy.$message.success('删除成功')
        handleQuery()
      }
    })
  }).catch(() => {
  });
}

import {getTask} from "@/api/project/task.js";

const task = ref({})
const showPreviewDialog = ref(false)

function handlePreview(row) {
  showPreviewDialog.value = true
  getTask(row.id).then(res => {
    task.value = res.data
    console.log(task.value)
  })
}

function handleCopyTaskFilePath(item) {
  var content = item.filePath
  // 创建一个临时的 textarea 元素
  var textarea = document.createElement('textarea');
  // 将内容设置为要复制的文本
  textarea.value = content;
  // 将 textarea 元素添加到 DOM 中
  document.body.appendChild(textarea);
  // 选中 textarea 中的内容
  textarea.select();
  // 执行复制命令
  document.execCommand('copy');
  // 移除 textarea 元素
  document.body.removeChild(textarea);

  // 提示用户已经复制内容
  proxy.$message.success('复制成功')
}

function computedDateDiff(date) {
  date = parseTime(date, "{yyyy}-{mm}-{dd} {hh}:{ii}:{ss}")
  let diff = getDateDiff(date)
  if (diff === '') {
    return formatDateToEnglish(date)
  } else {
    return diff
  }
}

// 任务类型
const taskType = {
  NAME: 0,
  STATUS: 1,
  URGENCY: 2,
  ORDER: 3,
  DESCRIPTION: 4,
  ASSIGN: 5,
  TIME: 6,
  TAG: 7,
  CHILD_TASK: 8,
  FILE: 9
}

function getFilePath(name) {
  return import.meta.env.VITE_APP_BASE_API + name
}

function init() {
  handleQuery()
  handleProjectOptions()
}

import router from "@/router/index.js";

function toTask() {
  var taskId = task.value.id
  var pjProjectId = task.value.pjProjectId
  router.push({
    path: '/project/task',
    query: {
      projectId: pjProjectId,
      taskId: taskId
    }
  })
}

init()
</script>

<template>
  <div class="app-container">
    <el-form :model="queryParams" inline class="demo-form-inline">
      <el-form-item label="名称">
        <el-input v-model="queryParams.name" placeholder="任务名称"></el-input>
      </el-form-item>
      <el-form-item label="项目">
        <el-select v-model="queryParams.pjProjectId" value-key="id" filterable @visible-change="projectSelectChange">
          <el-option v-for="item in projectOptions" :key="item.id" :label="item.name" :value="item.id"/>
        </el-select>
      </el-form-item>
      <el-form-item label="执行人">
        <el-select v-model="queryParams.projectUserId" value-key="userId" filterable @visible-change="userSelectChange">
          <el-option v-for="item in userOptions" :key="item.userId" :label="item.nickName" :value="item.userId"/>
        </el-select>
      </el-form-item>
      <el-form-item label="状态">
        <el-select v-model="queryParams.status" placeholder="状态">
          <el-option label="未开始" :value="0"></el-option>
          <el-option label="进行中" :value="1"></el-option>
          <el-option label="已完成" :value="2"></el-option>
        </el-select>
      </el-form-item>
      <el-form-item label="紧急程度">
        <el-select v-model="queryParams.urgency" placeholder="紧急程度">
          <el-option label="一般" :value="0"></el-option>
          <el-option label="紧急" :value="1"></el-option>
          <el-option label="非常紧急" :value="2"></el-option>
        </el-select>
      </el-form-item>
      <el-form-item>
        <el-button type="primary" @click="handleQuery">查询</el-button>
        <el-button @click="resetQuery">重置</el-button>
      </el-form-item>
    </el-form>
    <el-row :gutter="10" class="mb8">
      <el-col :span="1.5">
        <el-button
            type="danger"
            plain
            icon="Delete"
            @click="handleDelete"
        >删除
        </el-button>
      </el-col>
    </el-row>
    <el-table :data="tableData" @selection-change="handleSelectionChange">
      <el-table-column type="selection" align="center"></el-table-column>
      <el-table-column prop="id" label="id" align="center" width="50"></el-table-column>
      <el-table-column prop="name" label="任务名称" align="center"></el-table-column>
      <el-table-column  label="父任务" align="center">
        <template #default="{row}">
          <span v-if="row.parentId !== null">{{row.parentName}}</span>
          <el-tag v-else type="success">无</el-tag>
        </template>
      </el-table-column>
      <el-table-column prop="projectName" label="所属项目" align="center">
        <template #default="{row}">
          {{ row.pjProjectName }}
        </template>
      </el-table-column>
      <el-table-column prop="projectUserId" label="执行人" align="center">
        <template #default="{row}">
          <span v-if="row.projectUserId !== null">{{ row.assignUserName }}</span>
          <el-tag v-else type="info">暂无</el-tag>
        </template>
      </el-table-column>
      <el-table-column prop="status" label="状态" align="center">
        <template #default="{row}">
          <el-tag v-if="row.status === 0" type="info">未开始</el-tag>
          <el-tag v-if="row.status === 1" type="success">进行中</el-tag>
          <span v-if="row.status === 2">
            <el-tag type="danger">已完成</el-tag>
            <div>实际结束时间：{{ parseTime(row.realEndTime) }}</div>
          </span>
        </template>
      </el-table-column>
      <el-table-column prop="urgency" label="紧急程度" align="center">
        <template #default="{row}">
          <el-tag v-if="row.urgency === 0" type="info">一般</el-tag>
          <el-tag v-if="row.urgency === 1" type="success">紧急</el-tag>
          <el-tag v-if="row.urgency === 2" type="danger">非常紧急</el-tag>
        </template>
      </el-table-column>
      <el-table-column prop="beginTime" label="开始时间" align="center">
        <template #default="{row}">
          {{ parseTime(row.beginTime) }}
        </template>
      </el-table-column>
      <el-table-column prop="endTime" label="结束时间" align="center">
        <template #default="{row}">
          {{ parseTime(row.endTime) }}
        </template>
      </el-table-column>
      <el-table-column label="点赞数" prop="likeNum" align="center" width="70">
      </el-table-column>
      <el-table-column label="评论数" prop="logAndCommentSize" align="center" width="70">
      </el-table-column>
      <el-table-column label="文件数" prop="fileNum" align="center" width="70">
      </el-table-column>
      <el-table-column label="操作" align="center">
        <template #default="{row}">
          <el-button @click="handlePreview(row)" type="primary">预览</el-button>
          <el-button @click="handleDelete(row)" type="danger">删除</el-button>
        </template>
      </el-table-column>
    </el-table>
    <el-drawer v-model="showPreviewDialog" size="40%" title="任务相关信息预览">
      <div class="p-4" style="margin-top: -50px">
        <!-- 任务列表展示 -->
        <div class="mb-6">
          <el-descriptions
              class="margin-top"
              title="任务信息"
              :column="1"
              border
          >
            <template #extra>
              <el-button type="primary" @click="toTask">跳转操作</el-button>
            </template>
            <el-descriptions-item>
              <template #label>
                <div class="cell-item">
                  <svg t="1709218761940" class="icon" viewBox="0 0 1024 1024" version="1.1"
                       xmlns="http://www.w3.org/2000/svg" p-id="2345" width="16" height="16">
                    <path
                        d="M478.144 947.328c-120.448 0-176.96 0.128-297.408-0.064-104.384-0.128-146.432-42.56-146.496-147.264 0-195.008-0.128-389.952 0-584.96 0.064-92.224 44.48-137.792 137.152-137.984 247.04-0.576 430.144-0.64 677.184 0.064 95.104 0.256 140.992 47.36 141.056 141.696 0.128 196.032 0.128 392 0 588.032-0.064 95.872-44.16 140.096-140.992 140.416-123.456 0.384-246.976 0.064-370.496 0.064z m375.296-51.52c62.016-0.128 84.224-22.72 84.288-85.248v-596.992c0-62.528-22.208-85.312-84.16-85.312-248.96-0.128-433.984-0.128-682.944 0-62.016 0.064-84.224 22.72-84.288 85.248v596.992c0 62.592 22.208 85.248 84.16 85.312 123.456 0.192 182.976 0.064 306.432 0.064 125.44 0 251.008 0.128 376.512-0.064z"
                        fill="#101317" p-id="2346"></path>
                    <path
                        d="M594.176 358.912c0.576-26.24-2.432-50.88 8.768-74.048 27.264-56.576 77.952-56.896 130.624-57.024 49.024-0.128 94.272 7.232 114.304 57.6 19.776 49.664 20.864 103.296-0.576 152.256-25.984 59.456-82.368 58.048-136.64 57.28-46.912-0.704-86.464-13.632-108.224-59.584-11.968-25.216-6.912-52.032-8.256-76.48z m51.84 1.024c-0.384 76.544 6.144 82.944 83.328 82.944 7.104 0 14.208 0.128 21.312-0.064 32.832-1.024 53.44-14.656 56.128-44.096 5.12-56.512 6.208-99.84-26.752-114.048a58.112 58.112 0 0 0-20.736-3.84 1113.856 1113.856 0 0 0-67.008 0c-29.184 1.152-44.16 16.32-46.144 45.632-0.768 11.136-0.128 22.336-0.128 33.472z m-319.232 416.768c-58.176 0-52.288 0.064-110.464-0.064-9.152 0-18.496 0.256-27.456-1.28-13.12-2.24-23.488-9.6-23.872-23.808-0.384-15.744 10.24-25.6 24.896-25.664 135.68-0.576 207.296-0.576 342.976 0 13.312 0.064 23.104 8.768 23.424 23.488 0.384 16.32-10.112 24.832-24.576 25.92-23.36 1.664-46.848 1.28-70.336 1.344-44.8 0.192-89.728 0.064-134.592 0.064z m-121.792-109.376c-19.2 0-40.256-1.216-39.552-26.496 0.576-22.976 21.376-24.512 38.976-24.576 125.248-0.32 186.56-0.32 311.808-0.128 18.88 0.064 39.872 1.728 39.232 27.328-0.64 24.064-20.928 23.808-38.656 23.808-63.168 0.128-126.272 0.064-189.44 0.064h-122.368z"
                        fill="#101317" p-id="2347"></path>
                  </svg>
                  名称
                </div>
              </template>
              {{ task.name }}
            </el-descriptions-item>
            <el-descriptions-item>
              <template #label>
                <div class="cell-item">
                  <svg t="1709220648546" class="icon" viewBox="0 0 1024 1024" version="1.1"
                       xmlns="http://www.w3.org/2000/svg" p-id="3348" width="16" height="16">
                    <path
                        d="M416.19 840.31A34.92 34.92 0 0 1 391.42 830L194 632.68a35 35 0 0 1 0-49.55l459.24-459.32a89 89 0 0 1 125.92 0l121.06 121.06a89.17 89.17 0 0 1 0 125.92L441 830a34.92 34.92 0 0 1-24.81 10.31z m-147.88-232.4l147.88 147.82 434.48-434.49a19 19 0 0 0 0-26.83L729.61 173.36a19 19 0 0 0-26.83 0z"
                        fill="#42494F" p-id="3349"></path>
                    <path
                        d="M168.87 926.26A71.37 71.37 0 0 1 102 830.87l83.76-234.73a35.12 35.12 0 0 1 25.32-22.45 35.55 35.55 0 0 1 32.44 9.44L441 780.5a35 35 0 0 1-13 57.76L193.17 922a71.54 71.54 0 0 1-24.3 4.26z m64.26-254.44L168 854.41l184.27-63.51-59.61-59.54z"
                        fill="#42494F" p-id="3350"></path>
                  </svg>
                  描述
                </div>
              </template>
              <span v-html="task.description"></span>
            </el-descriptions-item>
            <el-descriptions-item>
              <template #label>
                <div class="cell-item">
                  <svg t="1709220672420" class="icon" viewBox="0 0 1024 1024" version="1.1"
                       xmlns="http://www.w3.org/2000/svg" p-id="4396" width="16" height="16">
                    <path
                        d="M410.67 544H133.33A69.33 69.33 0 0 0 64 613.33v277.34A69.33 69.33 0 0 0 133.33 960h277.34A69.33 69.33 0 0 0 480 890.67V613.33A69.33 69.33 0 0 0 410.67 544zM402 842a40 40 0 0 1-40 40H182a40 40 0 0 1-40-40V662a40 40 0 0 1 40-40h180a40 40 0 0 1 40 40z m488.67-298H613.33A69.33 69.33 0 0 0 544 613.33v277.34A69.33 69.33 0 0 0 613.33 960h277.34A69.33 69.33 0 0 0 960 890.67V613.33A69.33 69.33 0 0 0 890.67 544zM882 842a40 40 0 0 1-40 40H662a40 40 0 0 1-40-40V662a40 40 0 0 1 40-40h180a40 40 0 0 1 40 40zM410.67 64H133.33A69.33 69.33 0 0 0 64 133.33v277.34A69.33 69.33 0 0 0 133.33 480h277.34A69.33 69.33 0 0 0 480 410.67V133.33A69.33 69.33 0 0 0 410.67 64zM402 362a40 40 0 0 1-40 40H182a40 40 0 0 1-40-40V182a40 40 0 0 1 40-40h180a40 40 0 0 1 40 40z m292.49 94.18a81.35 81.35 0 0 0 115 0l126.69-126.67a81.35 81.35 0 0 0 0-115L809.51 87.82a81.35 81.35 0 0 0-115 0L567.82 214.49a81.35 81.35 0 0 0 0 115z"
                        fill="#3283FA" p-id="4397"></path>
                  </svg>
                  关联项目
                </div>
              </template>
              <span v-if="task.parentId !== null">{{ task.parentName }}</span>
              <el-tag v-else type="info">无</el-tag>
            </el-descriptions-item>
            <el-descriptions-item>
              <template #label>
                <div class="cell-item">
                  <svg t="1709220696712" class="icon" viewBox="0 0 1071 1024" version="1.1"
                       xmlns="http://www.w3.org/2000/svg" p-id="5398" width="16" height="16">
                    <path
                        d="M0 154.890336C24.650782 74.379527 71.690805 17.388729 159.438541 2.914876 172.555471 0.653336 185.898554 0.201028 199.015484 0.201028c203.990871 0 407.981742-0.452308 612.198766 0 123.480062 0 204.669333 80.510809 205.800103 203.538563 0 16.283085 0.452308 32.792324-0.452308 49.075409-1.13077 24.650782-12.890776 42.743098-38.898481 42.290791-26.007705-0.452308-37.315403-17.640009-37.315403-43.42156 0-26.912321 0-53.14618-5.201541-79.606194-10.629236-55.181566-48.396947-90.687738-103.578513-91.140045-216.203185-0.678462-432.632523-0.678462-648.835708 0-64.906186 0.678462-107.196976 49.075409-107.196977 121.444675-0.678462 163.96162-0.452308 328.149394-0.452308 492.111015 0 41.838482-0.452308 84.129273 0 126.193909 1.13077 77.796962 45.230792 121.218522 122.8016 121.67083 38.898481 0 77.796962-0.452308 116.695443 0.452308 30.983092 0.678462 49.527717 15.830777 48.396947 39.576943-1.583078 28.269245-21.484626 39.350789-46.135408 39.576942-55.181566 1.13077-110.589286 5.201541-165.770851-4.070771-56.764644-10.176928-98.603126-42.743098-126.872371-92.496969-10.176928-17.640009-16.283085-37.315403-24.198474-56.312336V154.890336z m0 0"
                        fill="#359EFF" p-id="5399"></path>
                    <path
                        d="M755.354223 219.344214c84.129273 4.523079 153.332384 49.075409 189.517017 137.501607 35.053864 86.164658 19.223087 166.22316-45.230792 232.938578-23.067704 23.746166-15.378469 29.400015 6.784619 44.55233 89.556968 61.287723 147.678535 143.833918 163.509312 253.06628 4.975387 32.792324-8.367696 55.860028-33.244632 59.704645-24.198474 3.844617-41.612328-15.830777-45.683099-50.206179-15.152315-130.038526-136.823145-241.758582-260.529361-236.104733-86.164658 4.070771-145.416996 55.633874-192.909327 122.349292-24.650782 34.82771-40.707713 72.821575-44.55233 116.243135-2.713848 32.113862-21.484626 50.884641-44.55233 47.944639-23.746166-3.392309-37.767711-25.781551-33.696939-56.764644 14.247699-112.624672 74.85696-195.623174 166.675467-257.589359 21.258472-14.247699 24.650782-21.258472 5.201541-41.612328-64.680032-68.072342-81.867733-147.678535-46.813869-235.652425 33.923094-85.260042 113.303133-137.049299 215.524723-136.370838z m-10.403083 359.584795c78.24927-0.452308 140.215454-63.096955 140.215455-141.346224-0.452308-78.927732-64.680032-141.346224-144.738534-140.441609-77.344654 0.678462-139.310839 63.775416-140.215454 142.024686-0.678462 78.701578 63.096955 140.215454 144.738533 139.763147z m-420.872517-208.740104c-42.969252 0-86.164658 0.678462-129.13391-0.452308-32.56617-0.678462-52.467718-16.961547-52.015411-40.481559 0.452308-23.067704 20.806164-39.350789 53.14618-39.576942 87.069274-0.678462 173.912394-0.678462 260.981669 0 32.56617 0.452308 52.015411 16.961547 51.789256 40.707712-0.452308 23.520012-20.127702 38.446173-52.920026 39.350789-43.873868 0.904616-87.97389 0.452308-131.847758 0.452308z m-31.661554 140.215454H393.507888c24.198474 0 40.481559 10.85539 41.838483 35.053864 1.583078 26.460013-16.283085 40.029251-40.481559 40.481559-70.560035 1.13077-141.346224 1.13077-211.906259 0-24.650782-0.452308-41.838482-14.247699-40.481559-40.481559 1.583078-23.746166 17.866163-35.506172 41.838482-35.506171 36.636941 0.452308 72.143113 0.452308 108.101593 0.452307z m0 0"
                        fill="#359EFF" p-id="5400"></path>
                  </svg>
                  执行人
                </div>
              </template>
              <span v-if="task.projectUserId !== null">{{ task.assignUserName }}</span>
              <el-tag v-else type="info">无</el-tag>
            </el-descriptions-item>
            <el-descriptions-item>
              <template #label>
                <div class="cell-item">
                  <svg t="1709220719890" class="icon" viewBox="0 0 1024 1024" version="1.1"
                       xmlns="http://www.w3.org/2000/svg" p-id="6784" width="16" height="16">
                    <path
                        d="M928 700.992a16.032 16.032 0 0 1-16-16V608a96 96 0 0 0-96-96h-256a16.032 16.032 0 0 1-16-16v-96c0-8.8 7.2-16 16-16H608a96 96 0 0 0 96-96V96a96 96 0 0 0-96-96h-192a96 96 0 0 0-96 96v192a96 96 0 0 0 96 96h48c8.8 0 16 7.2 16 16v96c0 8.8-7.2 16-16 16h-256a96 96 0 0 0-96 96v76.992c0 8.8-7.2 16-16 16a96 96 0 0 0-96 96V928a96 96 0 0 0 96 96h96a96 96 0 0 0 96-96v-131.008a96 96 0 0 0-96-96 16.032 16.032 0 0 1-16-16V608c0-17.696 14.304-32 32-32h256c8.8 0 16 7.2 16 16v94.016c0 8.288-6.72 14.976-15.008 14.976H464a96 96 0 0 0-96 96V928a96 96 0 0 0 96 96h96a96 96 0 0 0 96-96v-131.008a96 96 0 0 0-96-96h-0.992a14.976 14.976 0 0 1-15.008-14.976V592c0-8.8 7.2-16 16-16h256c17.696 0 32 14.304 32 32v76.992c0 8.8-7.2 16-16 16a96 96 0 0 0-96 96V928a96 96 0 0 0 96 96h96a96 96 0 0 0 96-96v-131.008a96 96 0 0 0-96-96z m-736 64c17.6 0 32 14.4 32 32V928c0 17.6-14.4 32-32 32H96c-17.6 0-32-14.4-32-32v-131.008c0-17.6 14.4-32 32-32h96z m368 0c17.6 0 32 14.4 32 32V928c0 17.6-14.4 32-32 32h-96c-17.6 0-32-14.4-32-32v-131.008c0-17.6 14.4-32 32-32h96zM416 320c-17.6 0-32-14.4-32-32V96c0-17.6 14.4-32 32-32h192c17.6 0 32 14.4 32 32v192c0 17.6-14.4 32-32 32h-192z m544 608c0 17.6-14.4 32-32 32h-96c-17.6 0-32-14.4-32-32v-131.008c0-17.6 14.4-32 32-32h96c17.6 0 32 14.4 32 32V928z"
                        fill="#1CC6A1" p-id="6785"></path>
                  </svg>
                  父任务
                </div>
              </template>
              <span v-if="task.parentId !== null">{{ task.parentName }}</span>
              <el-tag v-else type="info">无</el-tag>
            </el-descriptions-item>
            <el-descriptions-item>
              <template #label>
                <div class="cell-item">
                  <svg t="1709220741653" class="icon" viewBox="0 0 1024 1024" version="1.1"
                       xmlns="http://www.w3.org/2000/svg" p-id="7771" width="16" height="16">
                    <path
                        d="M512 2.56C231.424 2.56 3.584 229.888 3.584 510.976S231.424 1018.88 512 1018.88s508.416-227.328 508.416-508.416S793.088 2.56 512 2.56z m0 941.568c-239.616 0-433.664-194.048-433.664-433.664C78.336 270.848 272.384 76.8 512 76.8s433.664 194.048 433.664 433.664-194.048 433.664-433.664 433.664z"
                        fill="#F4DCCB" p-id="7772"></path>
                    <path
                        d="M421.376 792.576c-111.616 0-202.24-90.624-202.24-202.24s90.624-202.24 202.24-202.24 202.24 90.624 202.24 202.24-90.624 202.24-202.24 202.24z m0-363.52c-89.088 0-161.28 72.192-161.28 161.28s72.192 161.28 161.28 161.28 161.28-72.192 161.28-161.28-72.192-161.28-161.28-161.28z"
                        fill="#FF9D4D" p-id="7773"></path>
                    <path
                        d="M602.624 792.576c-111.616 0-202.24-90.624-202.24-202.24s90.624-202.24 202.24-202.24 202.24 90.624 202.24 202.24-90.624 202.24-202.24 202.24z m0-363.52c-89.088 0-161.28 72.192-161.28 161.28s72.192 161.28 161.28 161.28 161.28-72.192 161.28-161.28-72.192-161.28-161.28-161.28z"
                        fill="#FF9D4D" p-id="7774"></path>
                    <path
                        d="M512 633.344c-111.616 0-202.24-90.624-202.24-202.24S400.384 228.864 512 228.864s202.24 90.624 202.24 202.24-90.624 202.24-202.24 202.24z m0-363.52c-89.088 0-161.28 72.192-161.28 161.28s72.192 161.28 161.28 161.28 161.28-72.192 161.28-161.28-72.192-161.28-161.28-161.28z"
                        fill="#FF9D4D" p-id="7775"></path>
                  </svg>
                  状态
                </div>
              </template>
              <el-tag v-if="task.status === 0" type="info">未开始</el-tag>
              <el-tag v-else-if="task.status === 1" type="success">进行中</el-tag>
              <div v-else>
                <el-tag type="danger">已结束</el-tag>
                结束时间：{{ parseTime(task.realEndTime) }}
              </div>
            </el-descriptions-item>
            <el-descriptions-item>
              <template #label>
                <div class="cell-item">
                  <svg t="1709220758589" class="icon" viewBox="0 0 1024 1024" version="1.1"
                       xmlns="http://www.w3.org/2000/svg" p-id="8763" width="16" height="16">
                    <path d="M0 0h1024v1024H0z" fill="#FFFFFF" p-id="8764"></path>
                    <path
                        d="M707.413333 279.125333a277.333333 277.333333 0 0 0-421.12 237.226667v268.8H785.066667v-315.733333c0-73.813333-29.866667-141.226667-77.653334-190.293334z m-232.106666 403.626667l24.32-149.333333-72.96-21.333334 97.706666-170.666666v128l72.96 21.333333-122.026666 192z"
                        fill="#CCE1FE" p-id="8765"></path>
                    <path
                        d="M475.306667 682.666667l24.32-149.333334L426.666667 512l97.706666-170.666667v128l72.96 21.333334-122.026666 192z"
                        fill="#3974C7" p-id="8766"></path>
                    <path
                        d="M905.386667 787.2H853.333333V469.333333c0-176.64-134.826667-322.133333-306.773333-339.626666V110.933333h59.306667c18.773333 0 34.133333-15.36 34.133333-34.133333 0-18.773333-15.36-34.133333-34.133333-34.133333H418.133333c-18.773333 0-34.133333 15.36-34.133333 34.133333 0 18.773333 15.36 34.133333 34.133333 34.133333h60.16v18.773334C305.92 146.773333 170.666667 292.266667 170.666667 469.333333v317.866667H118.613333c-18.346667 0-33.28 14.506667-33.28 32.853333s14.933333 33.28 33.28 33.28h786.773334c18.346667 0 33.28-14.933333 33.28-33.28 0-18.346667-14.933333-32.853333-33.28-32.853333zM238.933333 469.333333c0-150.613333 122.453333-273.066667 273.066667-273.066666 76.373333 0 145.92 31.573333 195.413333 82.773333A272.682667 272.682667 0 0 1 785.066667 469.333333v315.733334H238.933333V469.333333zM512 981.333333c46.933333 0 85.333333-38.4 85.333333-85.333333h-170.666666c0 46.933333 38.4 85.333333 85.333333 85.333333z"
                        fill="#303133" p-id="8767"></path>
                  </svg>
                  紧急程度
                </div>
              </template>
              <el-tag v-if="task.urgency === 0" type="info">一般</el-tag>
              <el-tag v-else-if="task.urgency === 1" type="warning">紧急</el-tag>
              <el-tag v-else type="danger">非常紧急</el-tag>
            </el-descriptions-item>
            <el-descriptions-item>
              <template #label>
                <div class="cell-item">
                  <svg t="1709220782137" class="icon" viewBox="0 0 1024 1024" version="1.1"
                       xmlns="http://www.w3.org/2000/svg" p-id="9761" width="16" height="16">
                    <path
                        d="M972.799424 665.600448H665.599808a25.599968 25.599968 0 0 0 0 51.199936h307.199616a25.599968 25.599968 0 0 0 0-51.199936z m0 153.599808H665.599808a25.599968 25.599968 0 0 0 0 51.199936h307.199616a25.599968 25.599968 0 0 0 0-51.199936z m0 153.599808H665.599808a25.599968 25.599968 0 0 0 0 51.199936h307.199616a25.599968 25.599968 0 0 0 0-51.199936zM540.518364 558.541382l213.196534-213.196534a25.599968 25.599968 0 0 0-36.198355-36.198354L504.32001 522.343027l-140.236625-140.236625a25.599968 25.599968 0 0 0-36.198355 36.198355l140.134225 140.236625-40.19195 40.19195a25.599968 25.599968 0 0 0 36.198355 36.198354l40.19195-40.191949 40.806349 40.806349a25.599968 25.599968 0 0 0 36.198354-36.198355zM512 0.00128a511.99936 511.99936 0 1 0 0 1023.99872c17.305578 0 34.355157-0.921599 51.199936-2.559997v-52.940734c-8.499189 0.972799-16.947179 2.150397-25.599968 2.559997v-126.361442a25.599968 25.599968 0 1 0-51.199936 0v126.310242A460.492224 460.492224 0 0 1 52.685374 537.600608H179.200416a25.599968 25.599968 0 0 0 0-51.199936H52.890174A464.613819 464.613819 0 0 1 486.400032 52.737214V179.201056a25.599968 25.599968 0 0 0 51.199936 0V52.788414A464.613819 464.613819 0 0 1 971.161026 486.400672H844.799584a25.599968 25.599968 0 0 0 0 51.199936h126.515042a446.207442 446.207442 0 0 1-10.854387 76.799904h52.838334A510.872961 510.872961 0 0 0 511.8976 0.00128z"
                        fill="#1296db" p-id="9762"></path>
                  </svg>
                  时间范围
                </div>
              </template>
              <span>{{ parseTime(task.beginTime) }} ~ {{ parseTime(task.endTime) }}</span>
            </el-descriptions-item>
            <el-descriptions-item>
              <template #label>
                <div class="cell-item">
                  <svg t="1709221337850" class="icon" viewBox="0 0 1024 1024" version="1.1"
                       xmlns="http://www.w3.org/2000/svg" p-id="16326" width="16" height="16">
                    <path
                        d="M920.528912 444.49616l-340.111125-340.114737a135.932464 135.932464 0 0 0-96.155899-39.758503L200.418112 64.662657h-0.018063C125.275769 64.662657 64.301413 125.40943 64.301413 200.548159v283.673992a136.091412 136.091412 0 0 0 39.881326 96.199248l340.230335 340.241173a136.022775 136.022775 0 0 0 192.369598 0l283.74624-283.76069c53.128139-53.131752 53.128139-139.277583 0-192.405722z m-45.209673 147.192436l-283.746241 283.760691a72.064544 72.064544 0 0 1-101.924964 0l-340.212273-340.241173A72.187367 72.187367 0 0 1 128.241582 484.218538V200.548159A72.021195 72.021195 0 0 1 200.396437 128.602826l283.843776-0.039737a71.887535 71.887535 0 0 1 50.935389 21.053294l340.114737 340.1039a72.104281 72.104281 0 0 1 0.0289 101.968313z"
                        fill="" p-id="16327"></path>
                    <path
                        d="M384.002258 255.999097c-70.69543 0-128.003161 57.307731-128.003161 128.003161S313.306828 511.998194 384.002258 511.998194s127.999548-57.307731 127.999548-127.999549S454.690463 255.999097 384.002258 255.999097z m45.296371 173.29592a64.059379 64.059379 0 1 1 18.759396-45.292759 63.640337 63.640337 0 0 1-18.763008 45.292759z"
                        fill="" p-id="16328"></path>
                  </svg>
                  标签
                </div>
              </template>
              <span><el-tag v-for="item in task.tagList" :type="item.type"
                            style="margin-left: 10px">{{ item.name }}</el-tag></span>
            </el-descriptions-item>
            <el-descriptions-item>
              <template #label>
                <div class="cell-item">
                  <svg t="1709220803385" class="icon" viewBox="0 0 1024 1024" version="1.1"
                       xmlns="http://www.w3.org/2000/svg" p-id="10789" width="16" height="16">
                    <path
                        d="M934.208 407.616a124.256 124.256 0 0 0-97.92-47.296h-218.432c11.904-33.28 19.808-69.44 22.624-104.416 4.352-54.4-4-102.72-24.192-139.712-24.832-45.536-67.136-73.92-122.304-82.112-24.96-3.712-46.496 1.088-63.904 14.272-35.2 26.656-41.632 77.376-49.12 136.096-5.984 46.976-12.736 100.16-35.52 138.336-15.2 25.472-44.8 59.296-125.888 59.296H134.944a102.304 102.304 0 0 0-102.208 102.176v386.24a102.304 102.304 0 0 0 102.208 102.176h616.544c28.064 0 55.616-9.6 77.6-27.04a125.376 125.376 0 0 0 44.032-69.408l84.8-362.592a124.16 124.16 0 0 0-23.712-106.016zM100.864 870.496v-386.24c0-18.784 15.264-34.048 34.08-34.048H206.72v454.336H134.944a34.112 34.112 0 0 1-34.08-34.048z m790.72-372.384l-84.8 362.624c-6.048 25.792-28.8 43.84-55.296 43.84H274.88V445.248c57.536-11.008 100.832-40.32 129.056-87.584 30.08-50.336 37.76-111.04 44.608-164.64 3.072-24.192 5.984-47.04 10.624-64.576 4.96-18.816 10.08-24.32 12.064-25.824 2.24-1.728 6.56-2.112 12.736-1.216 34.176 5.088 57.92 20.576 72.512 47.36 29.984 54.976 16.736 147.776-11.84 211.008a48.448 48.448 0 0 0 44.256 68.64h247.424c17.44 0 33.664 7.84 44.48 21.504 10.848 13.632 14.784 31.2 10.816 48.16z"
                        fill="#333333" p-id="10790"></path>
                  </svg>
                  点赞数
                </div>
              </template>
              {{ task.likeNum }}
            </el-descriptions-item>
            <el-descriptions-item>
              <template #label>
                <div class="cell-item">
                  <svg t="1709220830624" class="icon" viewBox="0 0 1024 1024" version="1.1"
                       xmlns="http://www.w3.org/2000/svg" p-id="11816" width="16" height="16">
                    <path
                        d="M970.666667 896H96A53.418667 53.418667 0 0 1 42.666667 842.666667V138.666667A53.418667 53.418667 0 0 1 96 85.333333h296.106667a52.181333 52.181333 0 0 1 37.546666 15.786667l109.226667 109.226667a12.245333 12.245333 0 0 0 7.68 2.986666h424.106667A53.418667 53.418667 0 0 1 1024 266.666667v576A53.418667 53.418667 0 0 1 970.666667 896z m-490.666667-274.773333l38.4 28.970666a85.333333 85.333333 0 1 0 25.6-34.133333l-38.4-28.970667a86.613333 86.613333 0 0 0 2.986667-56.746666l71.68-43.093334a85.333333 85.333333 0 1 0 110.933333-128.853333 83.797333 83.797333 0 0 0-50.944-17.066667 85.589333 85.589333 0 0 0-82.218667 109.653334L486.4 494.08A84.053333 84.053333 0 0 0 426.666667 469.333333a85.333333 85.333333 0 1 0 53.418666 151.893334z"
                        fill="#3860F8" p-id="11817"></path>
                    <path
                        d="M970.666667 896H96A53.418667 53.418667 0 0 1 42.666667 842.666667V138.666667A53.418667 53.418667 0 0 1 96 85.333333h296.106667a52.181333 52.181333 0 0 1 37.546666 15.786667l109.226667 109.226667a12.245333 12.245333 0 0 0 7.68 2.986666h424.106667A53.418667 53.418667 0 0 1 1024 266.666667v576A53.418667 53.418667 0 0 1 970.666667 896z m-490.666667-274.773333l38.4 28.970666a85.333333 85.333333 0 1 0 25.6-34.133333l-38.4-28.970667a86.613333 86.613333 0 0 0 2.986667-56.746666l71.68-43.093334a85.333333 85.333333 0 1 0 110.933333-128.853333 83.797333 83.797333 0 0 0-50.944-17.066667 85.589333 85.589333 0 0 0-82.218667 109.653334L486.4 494.08A84.053333 84.053333 0 0 0 426.666667 469.333333a85.333333 85.333333 0 1 0 53.418666 151.893334z"
                        fill="#3860F8" p-id="11818"></path>
                  </svg>
                  关联文件数
                </div>
              </template>
              {{ task.fileNum }}
            </el-descriptions-item>
            <el-descriptions-item>
              <template #label>
                <div class="cell-item">
                  <svg t="1709220853924" class="icon" viewBox="0 0 1026 1024" version="1.1"
                       xmlns="http://www.w3.org/2000/svg" p-id="15319" width="16" height="16">
                    <path
                        d="M872.448 785.92H167.936L2.048 950.784V225.792c0-84.48 68.608-152.576 153.6-152.576h716.8c84.992 0 153.6 68.608 153.6 152.576v407.04c0 84.48-68.608 153.088-153.6 153.088z m-614.4-203.776h307.2c28.16 0 51.2-23.04 51.2-50.688 0-28.16-23.04-50.688-51.2-50.688h-307.2c-28.16 0-51.2 22.528-51.2 50.688s23.04 50.688 51.2 50.688z m512-305.152h-512c-28.16 0-51.2 23.04-51.2 50.688 0 28.16 23.04 50.688 51.2 50.688h512c28.16 0 51.2-23.04 51.2-50.688 0-28.16-23.04-50.688-51.2-50.688z"
                        fill="#00A0E9" p-id="15320"></path>
                  </svg>
                  评论数
                </div>
              </template>
              {{ task.commentNum }}
            </el-descriptions-item>
          </el-descriptions>
        </div>
        <!-- 关联文件展示 -->
        <div class="mb-6">
          <h2 class="font-semibold mb-2" style="font-size: 16px">关联文件</h2>
          <div v-for="(item, index) in task.fileList" :key="index"
               style="display: flex; justify-content: space-between; align-items: center; margin-bottom: 5px;">
            <div style="display: flex; align-items: center;">
              <svg v-if="item.fileSuffix === 'doc'" t="1708671882008" class="icon" viewBox="0 0 1024 1024"
                   version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="9417" width="16" height="16">
                <path
                    d="M901.850593 926.476283a48.761858 48.761858 0 0 1-48.761859 48.761859H170.422718a48.761858 48.761858 0 0 1-48.761858-48.761859V48.762834a48.761858 48.761858 0 0 1 48.761858-48.761859h418.864363a48.761858 48.761858 0 0 1 34.620919 14.140939l263.801654 263.801654a48.761858 48.761858 0 0 1 14.140939 34.620919V926.476283z"
                    fill="#EBECF0" p-id="9418"></path>
                <path
                    d="M901.850593 926.476283v48.761859a48.761858 48.761858 0 0 1-48.761859 48.761858H170.422718a48.761858 48.761858 0 0 1-48.761858-48.761858v-48.761859a48.761858 48.761858 0 0 0 48.761858 48.761859h682.666016a48.761858 48.761858 0 0 0 48.761859-48.761859z"
                    fill="#C1C7D0" p-id="9419"></path>
                <path
                    d="M24.137143 536.381417h975.237166v243.809291a48.761858 48.761858 0 0 1-48.761858 48.761859H72.899001a48.761858 48.761858 0 0 1-48.761858-48.761859v-243.809291z"
                    fill="#0747A6" p-id="9420"></path>
                <path
                    d="M121.66086 536.381417V438.8577l-97.523717 97.523717h97.523717zM901.850593 536.381417l0.975237-97.523717 97.036098 97.523717H901.850593z"
                    fill="#063266" p-id="9421"></path>
                <path
                    d="M236.251227 592.457554H311.832107a71.192313 71.192313 0 0 1 56.563756 24.868548A97.523717 97.523717 0 0 1 389.85108 682.666992a107.763707 107.763707 0 0 1-20.47998 67.778983 69.729457 69.729457 0 0 1-58.51423 26.331403H236.251227zM267.946434 747.032645h41.44758a41.935198 41.935198 0 0 0 35.596157-15.603795 73.142787 73.142787 0 0 0 12.678083-48.761858 68.75422 68.75422 0 0 0-13.653321-45.348528 44.86091 44.86091 0 0 0-36.571393-16.091414H267.946434zM511.755726 585.143275a83.870396 83.870396 0 0 1 65.34089 26.819022 97.523717 97.523717 0 0 1 23.893311 70.704695 103.37514 103.37514 0 0 1-24.380929 70.704694A82.407541 82.407541 0 0 1 511.755726 780.190708a83.870396 83.870396 0 0 1-65.34089-27.30664A100.937047 100.937047 0 0 1 421.546288 682.666992a100.449428 100.449428 0 0 1 24.868548-70.217076A83.382778 83.382778 0 0 1 511.755726 585.143275z m0 163.839844a52.662807 52.662807 0 0 0 42.422817-18.041888 73.142787 73.142787 0 0 0 15.116176-48.761858 70.217076 70.217076 0 0 0-16.091413-48.761858 53.638044 53.638044 0 0 0-41.935199-18.041888 52.662807 52.662807 0 0 0-41.935198 18.041888 71.192313 71.192313 0 0 0-15.603794 48.761858 70.704695 70.704695 0 0 0 16.091413 48.761858 53.150426 53.150426 0 0 0 41.935198 18.529507zM787.260226 701.196498a155.062709 155.062709 0 0 1-28.281878 58.026611 69.241839 69.241839 0 0 1-56.076137 20.967599 74.605643 74.605643 0 0 1-59.977086-25.356166 106.300851 106.300851 0 0 1-22.430455-72.16755 104.837995 104.837995 0 0 1 22.918074-71.679932A78.506592 78.506592 0 0 1 706.803159 585.143275q57.051374 0 76.556118 67.291365h-32.670445a48.761858 48.761858 0 0 0-43.885673-35.596157 48.761858 48.761858 0 0 0-39.009486 17.06665 69.729457 69.729457 0 0 0-14.628558 48.761859q0 66.803746 51.68757 66.803746a40.472342 40.472342 0 0 0 30.719971-11.215228 85.820871 85.820871 0 0 0 17.554269-35.596156z"
                    fill="#FFFFFF" p-id="9422"></path>
                <path
                    d="M905.263923 312.564487v6.82666h-264.289272a48.761858 48.761858 0 0 1-48.761859-48.761858V0.000975a48.761858 48.761858 0 0 1 34.62092 14.140939l264.289272 263.801654a48.761858 48.761858 0 0 1 14.140939 34.620919z"
                    fill="#C1C7D0" p-id="9423"></path>
              </svg>
              <svg v-else t="1708673747146" class="icon" viewBox="0 0 1024 1024" version="1.1"
                   xmlns="http://www.w3.org/2000/svg" p-id="48752" width="16" height="16">
                <path d="M0 0h1024v1024H0z" fill="#FFFFFF" p-id="48753"></path>
                <path
                    d="M130.9184 717.42464A87.12192 87.12192 0 0 0 209.92 768h604.16a87.1424 87.1424 0 0 0 87.04-87.04V394.83392z"
                    fill="#E4E7E9" p-id="48754"></path>
                <path
                    d="M214.26176 388.096a20.54144 20.54144 0 0 0 20.48 20.48h312.32a20.48 20.48 0 0 0 0-40.96h-312.32a20.54144 20.54144 0 0 0-20.48 20.48zM234.74176 488.448a20.48 20.48 0 0 0 0 40.96h166.912a20.48 20.48 0 0 0 0-40.96z"
                    fill="#CCCCCC" p-id="48755"></path>
                <path
                    d="M814.08 225.28h-97.28a15.36 15.36 0 0 0 0 30.72h97.28a87.1424 87.1424 0 0 1 87.04 87.04v337.92a87.1424 87.1424 0 0 1-87.04 87.04H209.92a87.13216 87.13216 0 0 1-87.04-87.04V343.04a87.1424 87.1424 0 0 1 87.04-87.04h97.28a15.36 15.36 0 0 0 0-30.72h-97.28A117.89312 117.89312 0 0 0 92.16 343.04v337.92a117.76 117.76 0 0 0 117.76 117.76h604.16a117.89312 117.89312 0 0 0 117.76-117.76V343.04a117.89312 117.89312 0 0 0-117.76-117.76z"
                    fill="#CCCCCC" p-id="48756"></path>
                <path d="M619.25376 684.032m-20.48 0a20.48 20.48 0 1 0 40.96 0 20.48 20.48 0 1 0-40.96 0Z"
                      fill="#CCCCCC" p-id="48757"></path>
                <path d="M702.84288 684.032m-20.48 0a20.48 20.48 0 1 0 40.96 0 20.48 20.48 0 1 0-40.96 0Z"
                      fill="#CCCCCC" p-id="48758"></path>
                <path d="M786.432 684.032m-20.48 0a20.48 20.48 0 1 0 40.96 0 20.48 20.48 0 1 0-40.96 0Z"
                      fill="#CCCCCC" p-id="48759"></path>
              </svg>
              <span style="margin-left: 20px;cursor: pointer" @click="downloadFile(item)">{{
                  item.fileName
                }}</span>
            </div>
            <div style="display: flex; align-items: center;">
              <div style="border-left: 1px solid #ccc; height: 20px; margin: 0 10px;"></div>
              <i class="el-icon-arrow-down arrow" style="font-size: 14px;"></i>
              <el-dropdown trigger="click">
                <svg t="1708673614126" class="icon" viewBox="0 0 1024 1024" version="1.1"
                     xmlns="http://www.w3.org/2000/svg" p-id="47521" width="16" height="16">
                  <path
                      d="M926.464 390.0928h48.7936v48.7424h-48.7936zM926.464 341.3504h48.7936v48.7424h-48.7936zM926.464 292.5568h48.7936v48.7936h-48.7936zM926.464 243.8144h48.7936v48.7424h-48.7936z"
                      fill="#012777" p-id="47522"></path>
                  <path
                      d="M926.464 195.072h48.7936v48.7424h-48.7936zM926.464 146.2784h48.7936v48.7936h-48.7936zM926.464 97.536h48.7936v48.7424h-48.7936zM877.7216 487.6288h48.7424v48.7424h-48.7424zM877.7216 438.8352h48.7424v48.7936h-48.7424z"
                      fill="#012777" p-id="47523"></path>
                  <path
                      d="M877.7216 390.0928h48.7424v48.7424h-48.7424zM877.7216 341.3504h48.7424v48.7424h-48.7424zM877.7216 292.5568h48.7424v48.7936h-48.7424zM877.7216 243.8144h48.7424v48.7424h-48.7424z"
                      fill="#DEE6FC" p-id="47524"></path>
                  <path
                      d="M877.7216 195.072h48.7424v48.7424h-48.7424zM877.7216 146.2784h48.7424v48.7936h-48.7424zM877.7216 97.536h48.7424v48.7424h-48.7424z"
                      fill="#DEE6FC" p-id="47525"></path>
                  <path
                      d="M877.7216 48.7424h48.7424v48.7936h-48.7424zM828.928 731.4432h48.7936v48.7424h-48.7936zM828.928 682.6496h48.7936v48.7936h-48.7936zM828.928 536.3712h48.7936v48.7936h-48.7936z"
                      fill="#012777" p-id="47526"></path>
                  <path
                      d="M828.928 487.6288h48.7936v48.7424h-48.7936zM828.928 438.8352h48.7936v48.7936h-48.7936z"
                      fill="#DEE6FC" p-id="47527"></path>
                  <path
                      d="M828.928 390.0928h48.7936v48.7424h-48.7936zM828.928 341.3504h48.7936v48.7424h-48.7936zM828.928 292.5568h48.7936v48.7936h-48.7936zM828.928 243.8144h48.7936v48.7424h-48.7936z"
                      fill="#DD75A1" p-id="47528"></path>
                  <path
                      d="M828.928 195.072h48.7936v48.7424h-48.7936zM828.928 146.2784h48.7936v48.7936h-48.7936z"
                      fill="#DD75A1" p-id="47529"></path>
                  <path d="M828.928 97.536h48.7936v48.7424h-48.7936z" fill="#DEE6FC" p-id="47530"></path>
                  <path
                      d="M828.928 48.7424h48.7936v48.7936h-48.7936zM780.1856 780.1856h48.7424v48.7424h-48.7424z"
                      fill="#012777" p-id="47531"></path>
                  <path
                      d="M780.1856 731.4432h48.7424v48.7424h-48.7424zM780.1856 682.6496h48.7424v48.7936h-48.7424z"
                      fill="#DEE6FC" p-id="47532"></path>
                  <path
                      d="M780.1856 633.9072h48.7424v48.7424h-48.7424zM780.1856 585.1648h48.7424v48.7424h-48.7424z"
                      fill="#012777" p-id="47533"></path>
                  <path d="M780.1856 536.3712h48.7424v48.7936h-48.7424z" fill="#DEE6FC" p-id="47534"></path>
                  <path
                      d="M780.1856 487.6288h48.7424v48.7424h-48.7424zM780.1856 438.8352h48.7424v48.7936h-48.7424z"
                      fill="#DD75A1" p-id="47535"></path>
                  <path
                      d="M780.1856 390.0928h48.7424v48.7424h-48.7424zM780.1856 341.3504h48.7424v48.7424h-48.7424zM780.1856 292.5568h48.7424v48.7936h-48.7424z"
                      fill="#012777" p-id="47536"></path>
                  <path d="M780.1856 243.8144h48.7424v48.7424h-48.7424z" fill="#DD75A1" p-id="47537"></path>
                  <path
                      d="M780.1856 195.072h48.7424v48.7424h-48.7424zM780.1856 146.2784h48.7424v48.7936h-48.7424z"
                      fill="#DD75A1" p-id="47538"></path>
                  <path d="M780.1856 97.536h48.7424v48.7424h-48.7424z" fill="#DEE6FC" p-id="47539"></path>
                  <path
                      d="M780.1856 48.7424h48.7424v48.7936h-48.7424zM731.4432 828.928h48.7424v48.7936h-48.7424z"
                      fill="#012777" p-id="47540"></path>
                  <path d="M731.4432 780.1856h48.7424v48.7424h-48.7424z" fill="#DEE6FC" p-id="47541"></path>
                  <path
                      d="M731.4432 731.4432h48.7424v48.7424h-48.7424zM731.4432 682.6496h48.7424v48.7936h-48.7424z"
                      fill="#DD75A1" p-id="47542"></path>
                  <path
                      d="M731.4432 633.9072h48.7424v48.7424h-48.7424zM731.4432 585.1648h48.7424v48.7424h-48.7424z"
                      fill="#DEE6FC" p-id="47543"></path>
                  <path
                      d="M731.4432 536.3712h48.7424v48.7936h-48.7424zM731.4432 487.6288h48.7424v48.7424h-48.7424z"
                      fill="#DD75A1" p-id="47544"></path>
                  <path d="M731.4432 438.8352h48.7424v48.7936h-48.7424z" fill="#012777" p-id="47545"></path>
                  <path
                      d="M731.4432 390.0928h48.7424v48.7424h-48.7424zM731.4432 341.3504h48.7424v48.7424h-48.7424zM731.4432 292.5568h48.7424v48.7936h-48.7424z"
                      fill="#375AA4" p-id="47546"></path>
                  <path d="M731.4432 243.8144h48.7424v48.7424h-48.7424z" fill="#012777" p-id="47547"></path>
                  <path
                      d="M731.4432 195.072h48.7424v48.7424h-48.7424zM731.4432 146.2784h48.7424v48.7936h-48.7424z"
                      fill="#DD75A1" p-id="47548"></path>
                  <path d="M731.4432 97.536h48.7424v48.7424h-48.7424z" fill="#DEE6FC" p-id="47549"></path>
                  <path
                      d="M731.4432 48.7424h48.7424v48.7936h-48.7424zM682.6496 877.7216h48.7936v48.7424h-48.7936z"
                      fill="#012777" p-id="47550"></path>
                  <path d="M682.6496 828.928h48.7936v48.7936h-48.7936z" fill="#DEE6FC" p-id="47551"></path>
                  <path d="M682.6496 780.1856h48.7936v48.7424h-48.7936z" fill="#DD75A1" p-id="47552"></path>
                  <path
                      d="M682.6496 731.4432h48.7936v48.7424h-48.7936zM682.6496 682.6496h48.7936v48.7936h-48.7936zM682.6496 633.9072h48.7936v48.7424h-48.7936zM682.6496 585.1648h48.7936v48.7424h-48.7936zM682.6496 536.3712h48.7936v48.7936h-48.7936zM682.6496 487.6288h48.7936v48.7424h-48.7936z"
                      fill="#DD75A1" p-id="47553"></path>
                  <path d="M682.6496 438.8352h48.7936v48.7936h-48.7936z" fill="#012777" p-id="47554"></path>
                  <path
                      d="M682.6496 390.0928h48.7936v48.7424h-48.7936zM682.6496 341.3504h48.7936v48.7424h-48.7936zM682.6496 292.5568h48.7936v48.7936h-48.7936z"
                      fill="#375AA4" p-id="47555"></path>
                  <path d="M682.6496 243.8144h48.7936v48.7424h-48.7936z" fill="#A2D8EA" p-id="47556"></path>
                  <path d="M682.6496 195.072h48.7936v48.7424h-48.7936z" fill="#012777" p-id="47557"></path>
                  <path d="M682.6496 146.2784h48.7936v48.7936h-48.7936z" fill="#DD75A1" p-id="47558"></path>
                  <path d="M682.6496 97.536h48.7936v48.7424h-48.7936z" fill="#DEE6FC" p-id="47559"></path>
                  <path
                      d="M682.6496 48.7424h48.7936v48.7936h-48.7936zM633.9072 926.464h48.7424v48.7936h-48.7424z"
                      fill="#012777" p-id="47560"></path>
                  <path d="M633.9072 877.7216h48.7424v48.7424h-48.7424z" fill="#DEE6FC" p-id="47561"></path>
                  <path
                      d="M633.9072 828.928h48.7424v48.7936h-48.7424zM633.9072 780.1856h48.7424v48.7424h-48.7424z"
                      fill="#DD75A1" p-id="47562"></path>
                  <path
                      d="M633.9072 731.4432h48.7424v48.7424h-48.7424zM633.9072 682.6496h48.7424v48.7936h-48.7424zM633.9072 633.9072h48.7424v48.7424h-48.7424zM633.9072 585.1648h48.7424v48.7424h-48.7424zM633.9072 536.3712h48.7424v48.7936h-48.7424zM633.9072 487.6288h48.7424v48.7424h-48.7424z"
                      fill="#DD75A1" p-id="47563"></path>
                  <path d="M633.9072 438.8352h48.7424v48.7936h-48.7424z" fill="#012777" p-id="47564"></path>
                  <path
                      d="M633.9072 390.0928h48.7424v48.7424h-48.7424zM633.9072 341.3504h48.7424v48.7424h-48.7424z"
                      fill="#375AA4" p-id="47565"></path>
                  <path
                      d="M633.9072 292.5568h48.7424v48.7936h-48.7424zM633.9072 243.8144h48.7424v48.7424h-48.7424z"
                      fill="#A2D8EA" p-id="47566"></path>
                  <path d="M633.9072 195.072h48.7424v48.7424h-48.7424z" fill="#012777" p-id="47567"></path>
                  <path d="M633.9072 146.2784h48.7424v48.7936h-48.7424z" fill="#DD75A1" p-id="47568"></path>
                  <path d="M633.9072 97.536h48.7424v48.7424h-48.7424z" fill="#DEE6FC" p-id="47569"></path>
                  <path
                      d="M633.9072 48.7424h48.7424v48.7936h-48.7424zM585.1648 926.464h48.7424v48.7936h-48.7424z"
                      fill="#012777" p-id="47570"></path>
                  <path
                      d="M585.1648 877.7216h48.7424v48.7424h-48.7424zM585.1648 828.928h48.7424v48.7936h-48.7424z"
                      fill="#DEE6FC" p-id="47571"></path>
                  <path d="M585.1648 780.1856h48.7424v48.7424h-48.7424z" fill="#012777" p-id="47572"></path>
                  <path
                      d="M585.1648 731.4432h48.7424v48.7424h-48.7424zM585.1648 682.6496h48.7424v48.7936h-48.7424z"
                      fill="#DEE6FC" p-id="47573"></path>
                  <path
                      d="M585.1648 633.9072h48.7424v48.7424h-48.7424zM585.1648 585.1648h48.7424v48.7424h-48.7424zM585.1648 536.3712h48.7424v48.7936h-48.7424zM585.1648 487.6288h48.7424v48.7424h-48.7424zM585.1648 438.8352h48.7424v48.7936h-48.7424z"
                      fill="#DD75A1" p-id="47574"></path>
                  <path d="M585.1648 390.0928h48.7424v48.7424h-48.7424z" fill="#012777" p-id="47575"></path>
                  <path
                      d="M585.1648 341.3504h48.7424v48.7424h-48.7424zM585.1648 292.5568h48.7424v48.7936h-48.7424zM585.1648 243.8144h48.7424v48.7424h-48.7424z"
                      fill="#A2D8EA" p-id="47576"></path>
                  <path d="M585.1648 195.072h48.7424v48.7424h-48.7424z" fill="#012777" p-id="47577"></path>
                  <path d="M585.1648 146.2784h48.7424v48.7936h-48.7424z" fill="#DD75A1" p-id="47578"></path>
                  <path d="M585.1648 97.536h48.7424v48.7424h-48.7424z" fill="#DEE6FC" p-id="47579"></path>
                  <path
                      d="M585.1648 48.7424h48.7424v48.7936h-48.7424zM536.3712 877.7216h48.7936v48.7424h-48.7936zM536.3712 828.928h48.7936v48.7936h-48.7936zM536.3712 731.4432h48.7936v48.7424h-48.7936zM536.3712 682.6496h48.7936v48.7936h-48.7936z"
                      fill="#012777" p-id="47580"></path>
                  <path d="M536.3712 633.9072h48.7936v48.7424h-48.7936z" fill="#DEE6FC" p-id="47581"></path>
                  <path
                      d="M536.3712 585.1648h48.7936v48.7424h-48.7936zM536.3712 536.3712h48.7936v48.7936h-48.7936zM536.3712 487.6288h48.7936v48.7424h-48.7936zM536.3712 438.8352h48.7936v48.7936h-48.7936zM536.3712 390.0928h48.7936v48.7424h-48.7936z"
                      fill="#DD75A1" p-id="47582"></path>
                  <path
                      d="M536.3712 341.3504h48.7936v48.7424h-48.7936zM536.3712 292.5568h48.7936v48.7936h-48.7936zM536.3712 243.8144h48.7936v48.7424h-48.7936z"
                      fill="#012777" p-id="47583"></path>
                  <path d="M536.3712 195.072h48.7936v48.7424h-48.7936z" fill="#DD75A1" p-id="47584"></path>
                  <path d="M536.3712 146.2784h48.7936v48.7936h-48.7936z" fill="#DEE6FC" p-id="47585"></path>
                  <path
                      d="M536.3712 97.536h48.7936v48.7424h-48.7936zM487.6288 731.4432h48.7424v48.7424h-48.7424z"
                      fill="#012777" p-id="47586"></path>
                  <path d="M487.6288 682.6496h48.7424v48.7936h-48.7424z" fill="#A2D8EA" p-id="47587"></path>
                  <path d="M487.6288 633.9072h48.7424v48.7424h-48.7424z" fill="#012777" p-id="47588"></path>
                  <path d="M487.6288 585.1648h48.7424v48.7424h-48.7424z" fill="#DEE6FC" p-id="47589"></path>
                  <path
                      d="M487.6288 536.3712h48.7424v48.7936h-48.7424zM487.6288 487.6288h48.7424v48.7424h-48.7424zM487.6288 438.8352h48.7424v48.7936h-48.7424zM487.6288 390.0928h48.7424v48.7424h-48.7424zM487.6288 341.3504h48.7424v48.7424h-48.7424zM487.6288 292.5568h48.7424v48.7936h-48.7424zM487.6288 243.8144h48.7424v48.7424h-48.7424z"
                      fill="#DD75A1" p-id="47590"></path>
                  <path d="M487.6288 195.072h48.7424v48.7424h-48.7424z" fill="#DD75A1" p-id="47591"></path>
                  <path d="M487.6288 146.2784h48.7424v48.7936h-48.7424z" fill="#DEE6FC" p-id="47592"></path>
                  <path
                      d="M487.6288 97.536h48.7424v48.7424h-48.7424zM438.8352 731.4432h48.7936v48.7424h-48.7936z"
                      fill="#012777" p-id="47593"></path>
                  <path d="M438.8352 682.6496h48.7936v48.7936h-48.7936z" fill="#375AA4" p-id="47594"></path>
                  <path d="M438.8352 633.9072h48.7936v48.7424h-48.7936z" fill="#A2D8EA" p-id="47595"></path>
                  <path d="M438.8352 585.1648h48.7936v48.7424h-48.7936z" fill="#012777" p-id="47596"></path>
                  <path d="M438.8352 536.3712h48.7936v48.7936h-48.7936z" fill="#DEE6FC" p-id="47597"></path>
                  <path
                      d="M438.8352 487.6288h48.7936v48.7424h-48.7936zM438.8352 438.8352h48.7936v48.7936h-48.7936zM438.8352 390.0928h48.7936v48.7424h-48.7936zM438.8352 341.3504h48.7936v48.7424h-48.7936zM438.8352 292.5568h48.7936v48.7936h-48.7936zM438.8352 243.8144h48.7936v48.7424h-48.7936z"
                      fill="#DD75A1" p-id="47598"></path>
                  <path d="M438.8352 195.072h48.7936v48.7424h-48.7936z" fill="#DEE6FC" p-id="47599"></path>
                  <path
                      d="M438.8352 146.2784h48.7936v48.7936h-48.7936zM390.0928 828.928h48.7424v48.7936h-48.7424zM390.0928 682.6496h48.7424v48.7936h-48.7424z"
                      fill="#012777" p-id="47600"></path>
                  <path d="M390.0928 633.9072h48.7424v48.7424h-48.7424z" fill="#375AA4" p-id="47601"></path>
                  <path d="M390.0928 585.1648h48.7424v48.7424h-48.7424z" fill="#A2D8EA" p-id="47602"></path>
                  <path d="M390.0928 536.3712h48.7424v48.7936h-48.7424z" fill="#012777" p-id="47603"></path>
                  <path d="M390.0928 487.6288h48.7424v48.7424h-48.7424z" fill="#DEE6FC" p-id="47604"></path>
                  <path
                      d="M390.0928 438.8352h48.7424v48.7936h-48.7424zM390.0928 390.0928h48.7424v48.7424h-48.7424zM390.0928 341.3504h48.7424v48.7424h-48.7424zM390.0928 292.5568h48.7424v48.7936h-48.7424z"
                      fill="#DD75A1" p-id="47605"></path>
                  <path d="M390.0928 243.8144h48.7424v48.7424h-48.7424z" fill="#DEE6FC" p-id="47606"></path>
                  <path
                      d="M390.0928 195.072h48.7424v48.7424h-48.7424zM341.3504 877.7216h48.7424v48.7424h-48.7424zM341.3504 633.9072h48.7424v48.7424h-48.7424z"
                      fill="#012777" p-id="47607"></path>
                  <path d="M341.3504 585.1648h48.7424v48.7424h-48.7424z" fill="#375AA4" p-id="47608"></path>
                  <path d="M341.3504 536.3712h48.7424v48.7936h-48.7424z" fill="#A2D8EA" p-id="47609"></path>
                  <path d="M341.3504 487.6288h48.7424v48.7424h-48.7424z" fill="#012777" p-id="47610"></path>
                  <path d="M341.3504 438.8352h48.7424v48.7936h-48.7424z" fill="#DEE6FC" p-id="47611"></path>
                  <path
                      d="M341.3504 390.0928h48.7424v48.7424h-48.7424zM341.3504 341.3504h48.7424v48.7424h-48.7424zM341.3504 292.5568h48.7424v48.7936h-48.7424z"
                      fill="#DD75A1" p-id="47612"></path>
                  <path d="M341.3504 243.8144h48.7424v48.7424h-48.7424z" fill="#DEE6FC" p-id="47613"></path>
                  <path
                      d="M341.3504 195.072h48.7424v48.7424h-48.7424zM292.5568 926.464h48.7936v48.7936h-48.7936zM292.5568 780.1856h48.7936v48.7424h-48.7936z"
                      fill="#012777" p-id="47614"></path>
                  <path
                      d="M292.5568 731.4432h48.7936v48.7424h-48.7936zM292.5568 585.1648h48.7936v48.7424h-48.7936z"
                      fill="#012777" p-id="47615"></path>
                  <path d="M292.5568 536.3712h48.7936v48.7936h-48.7936z" fill="#375AA4" p-id="47616"></path>
                  <path d="M292.5568 487.6288h48.7936v48.7424h-48.7936z" fill="#A2D8EA" p-id="47617"></path>
                  <path d="M292.5568 438.8352h48.7936v48.7936h-48.7936z" fill="#012777" p-id="47618"></path>
                  <path d="M292.5568 390.0928h48.7936v48.7424h-48.7936z" fill="#DEE6FC" p-id="47619"></path>
                  <path
                      d="M292.5568 341.3504h48.7936v48.7424h-48.7936zM292.5568 292.5568h48.7936v48.7936h-48.7936zM292.5568 243.8144h48.7936v48.7424h-48.7936z"
                      fill="#DD75A1" p-id="47620"></path>
                  <path d="M292.5568 195.072h48.7936v48.7424h-48.7936z" fill="#DEE6FC" p-id="47621"></path>
                  <path
                      d="M292.5568 146.2784h48.7936v48.7936h-48.7936zM243.8144 828.928h48.7424v48.7936h-48.7424z"
                      fill="#012777" p-id="47622"></path>
                  <path d="M243.8144 780.1856h48.7424v48.7424h-48.7424z" fill="#DEE6FC" p-id="47623"></path>
                  <path d="M243.8144 731.4432h48.7424v48.7424h-48.7424z" fill="#DD75A1" p-id="47624"></path>
                  <path
                      d="M243.8144 682.6496h48.7424v48.7936h-48.7424zM243.8144 536.3712h48.7424v48.7936h-48.7424zM243.8144 487.6288h48.7424v48.7424h-48.7424zM243.8144 438.8352h48.7424v48.7936h-48.7424z"
                      fill="#012777" p-id="47625"></path>
                  <path d="M243.8144 390.0928h48.7424v48.7424h-48.7424z" fill="#DEE6FC" p-id="47626"></path>
                  <path
                      d="M243.8144 341.3504h48.7424v48.7424h-48.7424zM243.8144 292.5568h48.7424v48.7936h-48.7424zM243.8144 243.8144h48.7424v48.7424h-48.7424z"
                      fill="#DD75A1" p-id="47627"></path>
                  <path d="M243.8144 195.072h48.7424v48.7424h-48.7424z" fill="#DEE6FC" p-id="47628"></path>
                  <path
                      d="M243.8144 146.2784h48.7424v48.7936h-48.7424zM195.072 877.7216h48.7424v48.7424H195.072z"
                      fill="#012777" p-id="47629"></path>
                  <path d="M195.072 828.928h48.7424v48.7936H195.072z" fill="#DEE6FC" p-id="47630"></path>
                  <path d="M195.072 780.1856h48.7424v48.7424H195.072z" fill="#DD75A1" p-id="47631"></path>
                  <path d="M195.072 731.4432h48.7424v48.7424H195.072z" fill="#DEE6FC" p-id="47632"></path>
                  <path d="M195.072 682.6496h48.7424v48.7936H195.072zM195.072 390.0928h48.7424v48.7424H195.072z"
                        fill="#012777" p-id="47633"></path>
                  <path d="M195.072 341.3504h48.7424v48.7424H195.072zM195.072 292.5568h48.7424v48.7936H195.072z"
                        fill="#DD75A1" p-id="47634"></path>
                  <path d="M195.072 243.8144h48.7424v48.7424H195.072z" fill="#DEE6FC" p-id="47635"></path>
                  <path d="M195.072 195.072h48.7424v48.7424H195.072zM146.2784 926.464h48.7936v48.7936h-48.7936z"
                        fill="#012777" p-id="47636"></path>
                  <path d="M146.2784 877.7216h48.7936v48.7424h-48.7936z" fill="#DEE6FC" p-id="47637"></path>
                  <path d="M146.2784 828.928h48.7936v48.7936h-48.7936z" fill="#DD75A1" p-id="47638"></path>
                  <path d="M146.2784 780.1856h48.7936v48.7424h-48.7936z" fill="#DEE6FC" p-id="47639"></path>
                  <path
                      d="M146.2784 731.4432h48.7936v48.7424h-48.7936zM146.2784 585.1648h48.7936v48.7424h-48.7936zM146.2784 438.8352h48.7936v48.7936h-48.7936z"
                      fill="#012777" p-id="47640"></path>
                  <path d="M146.2784 390.0928h48.7936v48.7424h-48.7936z" fill="#DEE6FC" p-id="47641"></path>
                  <path d="M146.2784 341.3504h48.7936v48.7424h-48.7936z" fill="#DD75A1" p-id="47642"></path>
                  <path d="M146.2784 292.5568h48.7936v48.7936h-48.7936z" fill="#DEE6FC" p-id="47643"></path>
                  <path
                      d="M146.2784 243.8144h48.7936v48.7424h-48.7936zM97.536 926.464h48.7424v48.7936h-48.7424z"
                      fill="#012777" p-id="47644"></path>
                  <path d="M97.536 877.7216h48.7424v48.7424h-48.7424z" fill="#DD75A1" p-id="47645"></path>
                  <path d="M97.536 828.928h48.7424v48.7936h-48.7424z" fill="#DEE6FC" p-id="47646"></path>
                  <path
                      d="M97.536 780.1856h48.7424v48.7424h-48.7424zM97.536 633.9072h48.7424v48.7424h-48.7424zM97.536 438.8352h48.7424v48.7936h-48.7424z"
                      fill="#012777" p-id="47647"></path>
                  <path d="M97.536 390.0928h48.7424v48.7424h-48.7424zM97.536 341.3504h48.7424v48.7424h-48.7424z"
                        fill="#DEE6FC" p-id="47648"></path>
                  <path
                      d="M97.536 292.5568h48.7424v48.7936h-48.7424zM48.7424 877.7216h48.7936v48.7424H48.7424zM48.7424 828.928h48.7936v48.7936H48.7424zM48.7424 682.6496h48.7936v48.7936H48.7424zM48.7424 390.0928h48.7936v48.7424H48.7424zM48.7424 341.3504h48.7936v48.7424H48.7424z"
                      fill="#012777" p-id="47649"></path>
                </svg>
                <template #dropdown>
                  <el-dropdown-menu>
                    <el-dropdown-item @click="handleCopyTaskFilePath(item)">复制文件链接</el-dropdown-item>
                  </el-dropdown-menu>
                </template>
              </el-dropdown>
            </div>
          </div>
        </div>
        <!-- 评论和日志展示 -->
        <div class="mb-6">
          <h2 class="font-semibold mb-2" style="font-size: 16px">评论和日志</h2>
          <!-- 消息列表 -->
          <div style=" overflow-y: auto;">
            <!-- 消息列表 -->
            <div class="message-list" style="flex-grow: 1; overflow-y: auto;">
              <!-- 评论 -->
              <div v-for="item in task.logAndCommentList">
                <div v-if="item.isLog === 0" class="message-item p-4">
                  <div class="flex items-center space-x-4  ">
                    <span
                        class="relative flex-shrink-0 overflow-hidden rounded-full w-10 h-10 bg-muted flex items-center justify-center">
                      <img :src="getFilePath(item.avatar)"/>
                    </span>
                    <div class="flex-1 grid gap-2.5">
                      <div class="font-semibold">{{ item.createBy }}</div>
                      <div class="text-base text-black">{{ item.content }}</div>
                    </div>
                    <div class="text-sm text-black ">{{ computedDateDiff(item.createTime) }}</div>
                  </div>
                </div>
                <!-- 日志 -->
                <div v-else class="w-full grid max-w-sm rounded-lg dark:divide-gray-800">
                  <div class="flex items-center p-4 space-x-4">
                    <div class="flex items-center flex-1">
                      <div class="  w-8 h-8 dark:bg-gray-800 flex items-center justify-center flex-shrink-0">
                        <!-- 任务状态 -->
                        <svg v-if="item.type === taskType.STATUS" t="1708494309753" class="icon"
                             viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                             p-id="27291" width="16" height="16">
                          <path
                              d="M933.034667 77.653333h-89.6v115.541334c0 58.368-45.568 105.642667-101.546667 105.642666-56.149333 0-101.546667-47.274667-101.546667-105.642666V77.653333H381.098667v115.541334c0 58.368-45.568 105.642667-101.546667 105.642666-56.149333 0-101.546667-47.274667-101.546667-105.642666V77.653333h-87.04C40.789333 77.653333 0 118.954667 0 169.984v761.685333C0 982.698667 40.789333 1024 90.965333 1024h841.898667c50.346667 0 90.965333-41.301333 90.965333-92.330667V169.984c0.170667-51.029333-40.618667-92.330667-90.794666-92.330667zM742.058667 460.8L490.666667 731.306667c-8.192 8.874667-19.456 13.824-31.232 13.824-11.434667 0-22.528-4.778667-30.549334-13.312l-149.162666-158.208c-12.970667-11.264-18.432-29.354667-13.994667-46.421334 4.437333-16.896 17.92-29.696 34.474667-32.597333 16.554667-2.901333 33.450667 4.437333 43.008 18.773333l115.541333 125.098667 222.037333-240.469333c17.066667-13.653333 41.301333-12.117333 56.661334 3.584 15.530667 16.042667 17.408 41.130667 4.608 59.221333z"
                              fill="#2B3F64" p-id="27292"></path>
                          <path
                              d="M741.717333 0c25.258667 0 45.909333 21.162667 45.909334 47.445333v142.848c0 26.282667-20.48 47.445333-45.909334 47.445334s-45.909333-21.162667-45.909333-47.445334V47.445333c0-26.282667 20.48-47.445333 45.909333-47.445333zM279.552 0c25.429333 0 45.909333 21.162667 45.909333 47.445333v142.848c0 26.282667-20.48 47.445333-45.909333 47.445334-25.258667 0-45.909333-21.162667-45.909333-47.445334V47.445333c0-26.282667 20.48-47.445333 45.909333-47.445333z"
                              fill="#2B3F64" p-id="27293"></path>
                        </svg>
                        <!-- 紧急程度 -->
                        <svg v-else-if="item.type === taskType.URGENCY" t="1708494135801" class="icon"
                             viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                             p-id="24693" width="16" height="16">
                          <path d="M0 0h1024v1024H0z" fill="#FFFFFF" p-id="24694"></path>
                          <path
                              d="M707.413333 279.125333a277.333333 277.333333 0 0 0-421.12 237.226667v268.8H785.066667v-315.733333c0-73.813333-29.866667-141.226667-77.653334-190.293334z m-232.106666 403.626667l24.32-149.333333-72.96-21.333334 97.706666-170.666666v128l72.96 21.333333-122.026666 192z"
                              fill="#CCE1FE" p-id="24695"></path>
                          <path
                              d="M475.306667 682.666667l24.32-149.333334L426.666667 512l97.706666-170.666667v128l72.96 21.333334-122.026666 192z"
                              fill="#3974C7" p-id="24696"></path>
                          <path
                              d="M905.386667 787.2H853.333333V469.333333c0-176.64-134.826667-322.133333-306.773333-339.626666V110.933333h59.306667c18.773333 0 34.133333-15.36 34.133333-34.133333 0-18.773333-15.36-34.133333-34.133333-34.133333H418.133333c-18.773333 0-34.133333 15.36-34.133333 34.133333 0 18.773333 15.36 34.133333 34.133333 34.133333h60.16v18.773334C305.92 146.773333 170.666667 292.266667 170.666667 469.333333v317.866667H118.613333c-18.346667 0-33.28 14.506667-33.28 32.853333s14.933333 33.28 33.28 33.28h786.773334c18.346667 0 33.28-14.933333 33.28-33.28 0-18.346667-14.933333-32.853333-33.28-32.853333zM238.933333 469.333333c0-150.613333 122.453333-273.066667 273.066667-273.066666 76.373333 0 145.92 31.573333 195.413333 82.773333A272.682667 272.682667 0 0 1 785.066667 469.333333v315.733334H238.933333V469.333333zM512 981.333333c46.933333 0 85.333333-38.4 85.333333-85.333333h-170.666666c0 46.933333 38.4 85.333333 85.333333 85.333333z"
                              fill="#303133" p-id="24697"></path>
                        </svg>
                        <!-- 标签 -->
                        <svg v-else-if="item.type === taskType.TAG" t="1708521861918" class="icon"
                             viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                             p-id="9716" width="16" height="16">
                          <path
                              d="M771.8912 108.1344H255.1296c-47.2576 0-85.5552 38.2976-85.5552 85.5552v156.4672h687.872V193.6896c0-47.2576-38.2976-85.5552-85.5552-85.5552z"
                              fill="#ffa115" p-id="9717"></path>
                          <path
                              d="M233.0624 970.1888c-15.8208 0-31.6416-4.096-46.1824-12.2368-30.0544-16.896-48.0256-47.5648-48.0256-82.0736V197.4272c0-73.4208 59.6992-133.12 133.12-133.12h485.4272c73.4208 0 133.12 59.6992 133.12 133.12v672.768c0 34.7648-19.0464 66.6112-49.7152 82.9952a93.96736 93.96736 0 0 1-96.6656-4.6592l-197.1712-131.4816a32.75264 32.75264 0 0 0-35.1232-0.7168l-229.888 139.9296c-15.2064 9.2672-32.0512 13.9264-48.896 13.9264z m38.912-844.4416c-39.5264 0-71.68 32.1536-71.68 71.68v678.4c0 17.2544 11.6736 25.7024 16.6912 28.5184 5.0176 2.816 18.2784 8.3968 33.024-0.5632l229.888-139.9296c31.1296-18.944 70.8608-18.1248 101.1712 2.0992L778.24 897.4336c10.1888 6.8096 22.784 7.424 33.5872 1.6384 10.8032-5.7856 17.2544-16.5888 17.2544-28.8256V197.4272c0-39.5264-32.1536-71.68-71.68-71.68H271.9744z"
                              fill="#474A54" p-id="9718"></path>
                          <path
                              d="M678.5024 287.0272H350.9248c-16.9472 0-30.72-13.7728-30.72-30.72s13.7728-30.72 30.72-30.72h327.6288c16.9472 0 30.72 13.7728 30.72 30.72s-13.7728 30.72-30.7712 30.72z"
                              fill="#474A54" p-id="9719"></path>
                        </svg>
                        <!-- 排序 -->
                        <svg v-else-if="item.type === taskType.ORDER" t="1708494388439" class="icon"
                             viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                             p-id="29898" width="16" height="16">
                          <path
                              d="M358.265 273.813l-111.561 94.165c-19.508 16.466-48.67 14-65.136-5.508-16.466-19.507-14-48.67 5.508-65.135l187.597-158.346c30.052-25.365 76.036-4.003 76.036 35.322v682.667c0 25.528-20.694 46.222-46.222 46.222-25.528 0-46.222-20.694-46.222-46.222V273.813z m410.837 389.409c19.507-16.466 48.67-14 65.135 5.508 16.466 19.507 14 48.67-5.507 65.135L641.132 892.211c-30.05 25.365-76.036 4.003-76.036-35.322V174.222c0-25.528 20.695-46.222 46.223-46.222 25.527 0 46.222 20.694 46.222 46.222v583.165l111.56-94.165z"
                              fill="#1296db" p-id="29899"></path>
                        </svg>
                        <!-- 描述 -->
                        <svg v-else-if="item.type === taskType.DESCRIPTION" t="1708494612416" class="icon"
                             viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                             p-id="41652" width="16" height="16">
                          <path
                              d="M887.466667 120.285867c0-24.9856-23.552-18.7392-30.890667-11.3664-13.994667 15.36-51.063467 46.557867-130.218667 63.010133a159.709867 159.709867 0 0 1-36.488533 3.959467c-38.161067 0-70.178133-12.458667-106.632533-27.2384-42.120533-16.452267-89.838933-35.157333-154.965334-35.157334-5.597867 0-11.195733 0-16.827733 0.546134-70.724267 3.413333-131.925333 34.6112-176.264533 57.890133-13.0048 6.587733-26.112 13.0048-39.253334 19.285333l-3.959466-9.6256-0.546134-0.580266a28.535467 28.535467 0 0 0-37.614933-15.325867 27.989333 27.989333 0 0 0-15.1552 15.906133 30.139733 30.139733 0 0 0 0 22.1184l292.4544 700.3136a28.194133 28.194133 0 0 0 26.385067 17.578667 24.917333 24.917333 0 0 0 11.229866-2.286933 29.0816 29.0816 0 0 0 15.1552-37.9904l-99.9424-239.5136a161.553067 161.553067 0 0 1 96.5632-73.181867 214.801067 214.801067 0 0 1 55.022934-7.406933c37.614933 0 74.069333 8.533333 112.810666 17.6128 35.362133 7.953067 71.304533 16.452267 106.666667 16.452266 53.316267 0 94.3104-18.7392 129.672533-58.4704a28.7744 28.7744 0 0 0 2.798934-9.079466V120.285867z"
                              fill="#85C2FF" p-id="41653"></path>
                        </svg>
                        <!-- 指派人 -->
                        <svg v-else-if="item.type === taskType.ASSIGN" t="1708494528945" class="icon"
                             viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                             p-id="39776" width="16" height="16">
                          <path
                              d="M1005.049995 672.258716a66.824088 66.824088 0 0 0-62.432952-38.000218h-154.42163a50.216585 50.216585 0 0 0 5.291883-34.284642 67.837427 67.837427 0 0 0-40.702457-51.398814 73.185606 73.185606 0 0 0-77.182666 12.216366l-12.66674 10.921545c-23.98236 20.66086-46.669898 40.195787-70.201885 61.419612H541.953996a26.065335 26.065335 0 0 0-25.277182 26.740895v248.887358a28.14831 28.14831 0 0 0 8.388196 18.352698 29.668319 29.668319 0 0 0 18.296402 7.037078h53.988458a104.9369 104.9369 0 0 1 11.540808 6.248925 96.436111 96.436111 0 0 0 15.706757 8.050417l10.865247 6.755594a67.555944 67.555944 0 0 0 17.789732 4.053357h145.977137l-0.731856-0.394077a31.751294 31.751294 0 0 0 13.792672-5.235585 57.535146 57.535146 0 0 0 48.696576-63.952961 9.288942 9.288942 0 0 0-1.125932-3.377797 23.475691 23.475691 0 0 1-1.351119-3.490391 52.63734 52.63734 0 0 0 27.585344-32.257963 63.164808 63.164808 0 0 0-2.308161-46.613602 67.555944 67.555944 0 0 0 14.243044-40.871346h41.772093a52.524747 52.524747 0 0 0 21.730495-2.702238 62.601842 62.601842 0 0 0 43.460991-36.592803 58.041816 58.041816 0 0 0 0.056297-51.511408z m-40.871347 28.936463a27.022378 27.022378 0 0 1-16.15713 11.259324h-0.562966a14.186748 14.186748 0 0 1-9.626722 2.364458h-82.981218l-12.891926 22.912725 6.924484 11.259324a19.81641 19.81641 0 0 1 1.238526 2.026678 20.379377 20.379377 0 0 1-8.83857 27.472751l-8.444493 7.037077-2.871127 22.518649 7.205967 7.205967a17.395656 17.395656 0 0 1 3.65928 19.253444 26.065335 26.065335 0 0 1-17.620842 13.680079l-11.259324 4.278543-7.149671 22.856428 7.374858 9.288942a13.286002 13.286002 0 0 1 3.49039 6.755595 17.226766 17.226766 0 0 1-12.891926 18.071215 20.773453 20.773453 0 0 0-3.490391 1.688898h-0.394076v0.394077c-0.844449 1.688899-4.16595 1.688899-6.417815 1.688898h-136.237821L643.287913 906.56525c-5.629662-2.420755-11.82229-5.629662-17.733436-9.120052-3.546687-1.970382-6.980781-3.884467-10.245985-5.629662a94.409432 94.409432 0 0 0-19.084554-4.053357H561.094847v-211.675292h33.777972a31.638701 31.638701 0 0 0 23.757174-8.3319c12.441553-10.808951 24.601623-21.561606 36.761693-32.31426 15.98824-14.130452 32.539447-28.767573 49.484729-43.404695a21.054936 21.054936 0 0 1 26.797191-6.192628c8.275603 5.629662 13.792672 10.245985 13.792672 15.931944a18.859368 18.859368 0 0 1-7.431153 16.888986l-2.364458 2.420755c-18.071215 11.259324-24.545326 23.98236-19.140851 38.000218a30.737955 30.737955 0 0 0 26.515708 15.368978h197.488544c12.891926 0 19.929004 3.99706 23.588284 13.680078a12.32896 12.32896 0 0 1 0.056296 13.060816z"
                              fill="#8BAEF7" p-id="39777"></path>
                          <path
                              d="M448.951979 956.444056H103.403324a21.167529 21.167529 0 0 1-15.594164-7.712637 32.14537 32.14537 0 0 1-7.205967-25.558666c29.893505-219.556819 198.952256-386.363705 396.384503-394.076342 4.785213 0 9.626722 0.394076 14.524528 0.394076 145.92084 0 264.594115-133.704473 264.594116-264.594115a264.594115 264.594115 0 1 0-409.895693 220.851641 472.103458 472.103458 0 0 0-172.492844 106.682096C87.47138 675.749107 30.668091 789.749763 13.722808 914.052701a99.645018 99.645018 0 0 0 23.250504 78.815268 88.554584 88.554584 0 0 0 66.486309 30.850548h345.492358a33.777972 33.777972 0 0 0 0-67.555944zM295.994062 264.783779A195.574459 195.574459 0 1 1 491.287038 460.358238 195.799645 195.799645 0 0 1 295.994062 264.783779z"
                              fill="#467CFD" p-id="39778"></path>
                        </svg>
                        <!-- 时间 -->
                        <svg v-else-if="item.type === taskType.TIME" t="1708494693058" class="icon"
                             viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                             p-id="50650" width="16" height="16">
                          <path
                              d="M912.82 342.68A436.48 436.48 0 1 0 947 512a433.41 433.41 0 0 0-34.18-169.32zM752.54 745.77l-3.66 3.89a27.2 27.2 0 0 1-38.28 1.16L560.14 609.21a108.49 108.49 0 1 1-77.89-201.56V253.08A27.11 27.11 0 0 1 509.33 226h5.34a27.11 27.11 0 0 1 27.08 27.08v154.57A108.46 108.46 0 0 1 604.26 569l147.12 138.5a27.11 27.11 0 0 1 1.16 38.27z"
                              fill="#F9DB91" p-id="50651"></path>
                          <path
                              d="M541.75 407.65V253.08A27.11 27.11 0 0 0 514.67 226h-5.34a27.11 27.11 0 0 0-27.08 27.08v154.57a109 109 0 0 1 59.5 0zM751.38 707.5L604.26 569a109.27 109.27 0 0 1-44.12 40.18L710.6 750.82a27.2 27.2 0 0 0 38.28-1.16l3.66-3.89a27.11 27.11 0 0 0-1.16-38.27z"
                              fill="#EF6A6A" p-id="50652"></path>
                          <path d="M604.26 569a108.48 108.48 0 1 0-44.12 40.18A109.27 109.27 0 0 0 604.26 569z"
                                fill="#AEF0FF"
                                p-id="50653"></path>
                          <path
                              d="M512 64C264.58 64 64 264.58 64 512s200.58 448 448 448 448-200.58 448-448S759.42 64 512 64z m298.4 746.4A420.48 420.48 0 0 1 525 933.8V896a13 13 0 0 0-26 0v37.8A421.57 421.57 0 0 1 90.2 525H128a13 13 0 0 0 0-26H90.2A421.57 421.57 0 0 1 499 90.2V128a13 13 0 0 0 26 0V90.2A421.57 421.57 0 0 1 933.8 499H896a13 13 0 0 0 0 26h37.8a420.48 420.48 0 0 1-123.4 285.4z"
                              fill="#512C56" p-id="50654"></path>
                          <path
                              d="M760.29 698L620.58 566.54a121.57 121.57 0 0 0-65.83-168.29V253.08A40.2 40.2 0 0 0 514.67 213h-5.34a40.2 40.2 0 0 0-40.08 40.08v145.17a121.52 121.52 0 1 0 88.33 226.4l144.11 135.64a40.2 40.2 0 0 0 56.65-1.72l3.66-3.89a40.19 40.19 0 0 0-1.71-56.68z m-265-444.95A14.27 14.27 0 0 1 509.33 239h5.34a14.27 14.27 0 0 1 14.08 14.08v138.58a122.56 122.56 0 0 0-33.5 0zM416.51 512A95.49 95.49 0 1 1 512 607.49 95.59 95.59 0 0 1 416.51 512z m326.56 224.86l-3.66 3.89a14.21 14.21 0 0 1-19.9 0.61L581.62 611.57a122.35 122.35 0 0 0 24.59-22.85L742.47 717a14.27 14.27 0 0 1 0.6 19.86z"
                              fill="#512C56" p-id="50655"></path>
                        </svg>
                        <!-- 子任务 -->
                        <svg v-else-if="item.type === taskType.CHILD_TASK" t="1708525997990" class="icon"
                             viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                             p-id="23851" width="16" height="16">
                          <path
                              d="M624 652.8h280c24 0 43.2-19.2 43.2-41.6V420.8c0-22.4-19.2-41.6-43.2-41.6H624c-24 0-43.2 19.2-43.2 41.6V486.4h-291.2V297.6H400c24 0 43.2-19.2 43.2-41.6V65.6c0-22.4-19.2-41.6-43.2-41.6H120c-24 0-43.2 19.2-43.2 41.6V256c0 22.4 19.2 41.6 43.2 41.6H230.4v595.2h348.8v65.6c0 22.4 19.2 41.6 43.2 41.6H902.4c24 0 43.2-19.2 43.2-41.6V768c0-22.4-19.2-41.6-43.2-41.6H624c-24 0-43.2 19.2-43.2 41.6v65.6h-291.2v-288h291.2V611.2c0 22.4 19.2 41.6 43.2 41.6z m12.8-222.4h252.8V601.6H636.8V430.4zM132.8 246.4v-172.8h252.8v171.2h-252.8v1.6z m504 531.2h252.8v171.2H636.8V777.6z"
                              fill="#346FF1" p-id="23852"></path>
                        </svg>
                        <!-- 任务名称 -->
                        <svg v-else-if="item.type === taskType.NAME" t="1708494215342" class="icon"
                             viewBox="0 0 1024 1024" version="1.1"
                             xmlns="http://www.w3.org/2000/svg" p-id="25761" width="16" height="16">
                          <path
                              d="M193.378462 759.729231c-48.600615-79.084308-30.326154-226.067692-13.154462-279.315693l48.128-11.382153A198.301538 198.301538 0 0 1 271.36 325.316923c66.599385-84.676923 256.078769-253.715692 620.189538-273.723077-132.529231 148.676923-227.682462 401.959385-251.31323 438.941539a815.104 815.104 0 0 1-97.988923 56.477538l44.032 42.968615s-244.224 210.313846-392.900923 169.747693"
                              fill="#49D2FF" p-id="25762"></path>
                          <path
                              d="M206.217846 742.518154c33.043692 6.695385 73.964308 0.787692 120.950154-16.344616 40.448-14.769231 83.810462-37.257846 128.433231-65.378461a1128.684308 1128.684308 0 0 0 101.179077-72.073846l-28.317539-27.608616a19.692308 19.692308 0 0 1 5.12-31.783384c31.507692-15.36 62.030769-32.846769 91.254154-52.263385 10.870154-23.748923 89.009231-190.582154 133.080615-267.618461 29.144615-50.963692 58.683077-96.098462 88.851693-134.774154-267.579077 24.654769-457.373538 132.411077-560.128 263.010461a178.609231 178.609231 0 0 0-38.675693 129.417846 19.692308 19.692308 0 0 1-15.084307 21.110154l-37.021539 8.743385c-20.283077 72.940308-20.873846 186.052923 10.358154 245.563077z m369.427692-190.424616l24.379077 23.788308a19.692308 19.692308 0 0 1-0.905846 29.026462c-1.732923 1.457231-4.883692 4.135385-9.412923 7.837538a1167.596308 1167.596308 0 0 1-113.073231 81.368616c-46.828308 29.499077-92.553846 53.208615-135.955692 69.04123-57.698462 21.070769-109.095385 27.411692-152.536615 15.517539a19.692308 19.692308 0 0 1-11.579077-8.664616c-44.110769-71.798154-42.417231-210.865231-15.044923-295.620923a19.692308 19.692308 0 0 1 14.178461-13.115077l32.059077-7.60123a217.796923 217.796923 0 0 1 48.088616-140.524308C371.042462 166.715077 587.067077 48.600615 890.486154 31.901538a19.692308 19.692308 0 0 1 15.753846 32.807385c-38.675692 43.401846-76.603077 98.697846-114.097231 164.233846-46.395077 81.132308-134.616615 271.005538-135.325538 272.147693l-5.592616 5.710769c-24.379077 16.423385-49.624615 31.507692-75.539692 45.292307z"
                              fill="#505050" p-id="25763"></path>
                          <path
                              d="M596.795077 246.153846l23.630769 31.547077A1376.689231 1376.689231 0 0 0 147.219692 921.757538l-37.139692-13.075692A1416.073846 1416.073846 0 0 1 596.795077 246.153846zM193.142154 953.344l-21.110154-33.240615c25.009231-15.911385 73.649231-38.872615 108.307692-48.167385 26.742154-7.168 47.497846-7.798154 62.660923 2.048 20.716308 13.390769 21.819077 38.360615 8.073847 70.498462-5.198769 12.209231-7.325538 8.192-2.363077 8.152615 14.060308-0.078769 39.896615-8.073846 73.412923-22.646154 50.609231-21.976615 115.672615-57.501538 158.404923-83.574154a688.324923 688.324923 0 0 1 144.856615-66.402461c57.186462-17.880615 118.941538-16.699077 161.437539 4.52923 51.081846 25.560615 68.923077 76.130462 43.598769 138.909539l-36.548923-14.729846c17.841231-44.110769 7.719385-72.743385-24.654769-88.930462-32.531692-16.265846-83.928615-17.250462-131.859693-2.284307a648.467692 648.467692 0 0 0-136.310154 62.542769c-44.150154 26.939077-110.670769 63.251692-163.24923 86.094769-38.203077 16.580923-67.859692 25.757538-88.851693 25.875692-35.643077 0.196923-49.703385-26.584615-34.067692-63.054769 7.089231-16.620308 6.892308-21.819077 6.695385-21.937231-2.875077-1.890462-14.375385-1.536-31.035077 2.953846-30.404923 8.152615-75.500308 29.459692-97.398154 43.323077z"
                              fill="#505050" p-id="25764"></path>
                        </svg>
                        <svg v-else-if="item.type === taskType.FILE" t="1708653936999" class="icon"
                             viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg"
                             p-id="2327" width="16" height="16">
                          <path
                              d="M731.648 626.176l67.584-67.584c28.672-31.232 67.584-46.08 107.008-46.08V327.68c0-22.528-9.728-44.544-26.112-59.904L643.072 47.104c-22.528-20.992-52.224-32.768-83.456-32.768H147.456c-45.056 0-81.92 36.864-81.92 81.92v831.488c0 45.056 36.864 81.92 81.92 81.92h346.112c-30.72-58.368-20.48-133.632 30.208-184.832l67.584-67.584"
                              fill="#0067B1" p-id="2328"></path>
                          <path
                              d="M530.432 147.968v192c0 19.456 12.8 32.256 32.256 32.256h204.8c0-0.512-237.056-224.256-237.056-224.256zM186.368 377.344h151.04c11.264 0 20.48 9.216 20.48 20.48v55.296c0 11.264-9.216 20.48-20.48 20.48H186.368c-11.264 0-20.48-9.216-20.48-20.48V397.824c0-11.264 9.216-20.48 20.48-20.48zM186.368 574.976h323.584c11.264 0 20.48 9.216 20.48 20.48v55.296c0 11.264-9.216 20.48-20.48 20.48H186.368c-11.264 0-20.48-9.216-20.48-20.48v-55.296c0-11.264 9.216-20.48 20.48-20.48z"
                              fill="#FFFFFF" p-id="2329"></path>
                          <path
                              d="M965.632 617.984c-48.128-45.056-124.928-48.128-169.472 0l-51.2 51.2c-12.8 12.8-12.8 38.4 0 51.2s35.328 12.8 51.2 0l51.2-51.2c19.456-19.456 48.128-19.456 67.072 0s19.456 48.128 0 67.072l-51.2 51.2c-12.8 12.8-12.8 38.4 0 51.2s38.4 12.8 51.2 0l51.2-51.2c47.616-48.128 47.616-124.928 0-169.472z"
                              fill="#FF7F00" p-id="2330"></path>
                          <path
                              d="M780.8 764.928l-38.4 38.4c-9.728 9.728-9.728 28.672 0 38.4s28.672 9.728 38.4 0l35.328-35.328c9.728-9.728 9.728-28.672 0-38.4-9.728-12.8-26.112-12.8-35.328-3.072z"
                              fill="#FF7F00" p-id="2331"></path>
                          <path
                              d="M757.248 886.784l-51.2 51.2c-19.456 19.456-48.128 19.456-67.072 0-18.944-19.456-19.456-48.128 0-67.072l51.2-51.2c12.8-12.8 12.8-38.4 0-51.2s-38.4-12.8-51.2 0l-51.2 51.2c-48.128 48.128-48.128 124.928 0 169.472s124.928 48.128 169.472 0l51.2-51.2c12.8-12.8 12.8-38.4 0-51.2s-34.816-12.8-51.2 0z"
                              fill="#FF7F00" p-id="2332"></path>
                        </svg>
                        <!-- 错误 -->
                        <svg v-else t="1708615346285" class="icon" viewBox="0 0 1024 1024" version="1.1"
                             xmlns="http://www.w3.org/2000/svg" p-id="4026" width="16" height="16">
                          <path
                              d="M512 0a512 512 0 0 0-512 512 512 512 0 0 0 512 512 512 512 0 0 0 512-512 512 512 0 0 0-512-512z"
                              fill="#FD6B6D" p-id="4027"></path>
                          <path
                              d="M513.755429 565.540571L359.277714 720.018286a39.058286 39.058286 0 0 1-55.296-0.073143 39.277714 39.277714 0 0 1 0.073143-55.442286l154.331429-154.331428-155.062857-155.136a36.571429 36.571429 0 0 1 51.712-51.785143l365.714285 365.714285a36.571429 36.571429 0 1 1-51.785143 51.785143L513.755429 565.540571z m157.549714-262.582857a35.254857 35.254857 0 1 1 49.737143 49.737143l-106.057143 108.982857a35.254857 35.254857 0 1 1-49.883429-49.810285l106.203429-108.982858z"
                              fill="#FFFFFF" p-id="4028"></path>
                        </svg>
                      </div>

                      <div class="ml-4">
                        <p class="text-sm font-medium dark:text-gray-400" style="word-wrap: break-word;">
                          {{ item.content }}</p>
                      </div>
                    </div>
                    <div>
                      <time class="text-sm text-gray-500 dark:text-gray-400" style="white-space: nowrap;">
                        {{ computedDateDiff(item.createTime) }}
                      </time>
                    </div>
                  </div>
                  <hr class="border-gray-200 dark:border-gray-600">
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </el-drawer>
  </div>
</template>

<style scoped>
.el-descriptions {
  margin-top: 20px;
}

.message-list {
  flex-grow: 1;
  overflow-y: auto;
}

.cell-item {
  display: flex;
  align-items: center;
  gap: 10px;
}

.cell-item .icon {
  margin-bottom: 1px
}

.margin-top {
  margin-top: 20px;
}
</style>
